/*
Задача 64: Задайте значение N. Напишите программу, которая 
выведет все натуральные числа в промежутке от N до 1. 
Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
*/

string Numbers(int a, int n)
{
    if (1<=n) return $"{n} "+ Numbers(1, n-1);
    else return string.Empty;
}

System.Console.WriteLine(Numbers(1, 5));

// string NumbersRec(int a, int b)
// {
//     if (a <= b) return $"{a} " + NumbersRec(a + 1, b);
//     else return string.Empty;
// }